# Dotfiles Brewfile
# Install with: brew bundle --file=~/.dotfiles/Brewfile

# Core tools
brew "node"
brew "php"
brew "composer"
brew "pkgconf"
brew "wget"
brew "httpie"
brew "ncdu"
brew "hub"
brew "gh"
brew "ack"
brew "doctl"
cask "1password-cli"
brew "git-secret"
brew "imagemagick"
brew "yarn"
brew "ghostscript"
brew "mackup"
cask "raycast"
cask "ghostty"
brew "ddev/ddev/ddev"
tap "nicoverbruggen/cask"
tap "shivammathur/php"
tap "shivammathur/extensions"
cask "phpmon"

# Apps
cask "google-chrome"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "dbngin"
cask "github"
cask "httpie-desktop"
cask "imageoptim"
cask "tinkerwell"
cask "the-unarchiver"
cask "vlc"

# Zsh
brew "zsh-autosuggestions"

# Modern CLI tools
brew "starship"
brew "zoxide"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "git-delta"
brew "fnm"
brew "fzf"
brew "direnv"
brew "jq"
brew "yq"
brew "bottom"
brew "mas"
brew "tree"
brew "trash"
brew "uv"
brew "coreutils"
brew "gnu-sed"
brew "bash"

# Development tools
cask "claude-code"
brew "mkcert"
brew "php@8.4"

# Fonts
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-open-sans"
cask "font-roboto"
cask "font-bitter"
cask "font-lato"

# QuickLook plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzip"
cask "suspicious-package"
